/**
 * Здесь описывается структура данных "шаг программы".
 * Шаг программы отражает акт информационного взаимодействия
 * программы с окружением (например, обращение к ресурсам,
 * системные вызовы и т.п.)
 * Единичная история программы представляет собой последовательность шагов.
 * Поведение программы - это набор историй.
 * Чтобы не зависеть от конкретной реализации шага программы 
 * (какие данные нужны и что в точности представляет
 * шаг в плане реализации), мы разделяем интерфейс и реализацию.
 */
#include<iostream>
#include<string>
#include<vector>
#include<map>


/////////////////////////////////////////////////////////////////////////////
//// Интерфейсная часть
///////////////////////////////////////////////////////////////////////////////


///////////////////////////////////////////////////////////////////////////////
//// Реализация
///////////////////////////////////////////////////////////////////////////////



